Documents/ПрикрепитьФайлы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>ПрикрепитьФайлы</Name>
			<BasedOn>
				<xr:Item>Catalog.ДолговыеОбязательства</xr:Item>
				<xr:Item>Catalog.Контрагенты</xr:Item>
				<xr:Item>Catalog.ДоговорыКонтрагентов</xr:Item>
				<xr:Item>Catalog.УслугиПоДоговору</xr:Item>
				<xr:Item>Catalog.ИсполнительныеДокументы</xr:Item>
				<xr:Item>Document.ОбещанныеПлатежи</xr:Item>
				<xr:Item>Document.НеподтвержденныеПлатежи</xr:Item>
				<xr:Item>Catalog.Залоги</xr:Item>
				<xr:Item>Catalog.ФССП_ИсполнительноеПроизводство</xr:Item>
				<xr:Item>Document.СудебноеДело</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПрикрепляемыеФайлы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.ИсходящаяКорреспонденция</v8:Type>
						<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
						<v8:Type>cfg:CatalogRef.ФССП_ИсполнительноеПроизводство</v8:Type>
						<v8:Type>cfg:DocumentRef.СудебноеДело</v8:Type>
						<v8:Type>cfg:DocumentRef.ПартионнаяПочта</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Залоги</v8:Type>
						<v8:Type>cfg:CatalogRef.ВходящаяКорреспонденция</v8:Type>
						<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
						<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаСервере</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Каталог</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистраторКорреспонденции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсходящаяКорреспонденция</v8:Type>
						<v8:Type>cfg:CatalogRef.ВходящаяКорреспонденция</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Файлы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипФайла</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыПрикрепляемыхФайлов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Путь</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>300</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Загружен</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Размер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Хранилище</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УИД</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ПрикрепляемыеФайлы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>ПрикрепляемыеФайлы</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.ИсходящаяКорреспонденция</v8:Type>
						<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
						<v8:Type>cfg:CatalogRef.ФССП_ИсполнительноеПроизводство</v8:Type>
						<v8:Type>cfg:DocumentRef.СудебноеДело</v8:Type>
						<v8:Type>cfg:DocumentRef.ПартионнаяПочта</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Залоги</v8:Type>
						<v8:Type>cfg:CatalogRef.ВходящаяКорреспонденция</v8:Type>
						<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
						<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипФайла</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыПрикрепляемыхФайлов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерСтроки_</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ПрикрепитьФайлы/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)	
	Движения.ПрикрепляемыеФайлы.Записывать = Истина;
	Для Каждого ТекСтрокаФайлы Из Файлы Цикл
		Движение = Движения.ПрикрепляемыеФайлы.Добавить();
		Движение.Период = Дата;
		Движение.Объект = Объект;
		Движение.ТипФайла = ТекСтрокаФайлы.ТипФайла;
		Движение.РазмерФайла = ТекСтрокаФайлы.Размер;
		Движение.НомерСтроки_ = ТекСтрокаФайлы.НомерСтроки;
		Файл = Новый Файл(ТекСтрокаФайлы.Путь);
		Движение.ИмяФайла = Файл.Имя;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьФайлыНаСервер(Файлы, Отказ)
	КаталогХранения = Константы.КаталогХраненияПрикрепляемыхФайловНаСервере.Получить();
	Ф = Новый Файл(КаталогХранения); 	
	Если Ф.Существует() = Ложь Тогда
		Сообщить("Каталог хранения прикрепляемых файлов задан неверно!");
		Возврат;
	КонецЕсли;
	
	Для Каждого Эл Из Файлы Цикл
		Если Не Эл.Загружен Тогда
			Попытка
				Файл = Новый Файл(Эл.Путь);
				Эл.УИД = Новый УникальныйИдентификатор();
				ДвДанные = Новый ДвоичныеДанные(Эл.Путь);
				ДвДанные.Записать(КаталогХранения + "\" + Строка(Эл.УИД) + Файл.Расширение);
			Исключение
				Отказ = Истина;
				Сообщить(ОписаниеОшибки());
				Возврат;
			КонецПопытки;
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ДанныеЗаполнения <> Неопределено Тогда
		//Организация = ДанныеЗаполнения.Организация;
		Объект = ДанныеЗаполнения;
	КонецЕсли;
КонецПроцедуры

Процедура ПоместитьВХранилище(МассивДанных) Экспорт
	Индекс = 0;
	Для Каждого Элемент Из ЭтотОбъект.Файлы Цикл
		Если МассивДанных[Индекс] <> Неопределено Тогда
			Элемент.Хранилище = Новый ХранилищеЗначения(МассивДанных[Индекс], Новый СжатиеДанных(9));
		КонецЕсли;
		Индекс = Индекс + 1;
	КонецЦикла;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//НаСервере = Константы.ХранитьПрикрепляемыеФайлыНаСервере.Получить();
	//Если НаСервере Тогда
	//	Каталог = Константы.КаталогХраненияПрикрепляемыхФайловНаСервере.Получить();
	//КонецЕсли;
	//Если Константы.ХранитьПрикрепляемыеФайлыНаСервере.Получить() Тогда
	//	// 1. Если хранить файлы на сервере
	//	КаталогХранения = Константы.КаталогХраненияПрикрепляемыхФайловНаСервере.Получить();
	//	Ф = Новый Файл(КаталогХранения); 	
	//	Если Ф.Существует() = Ложь Тогда
	//		Сообщить("Каталог хранения прикрепляемых файлов задан неверно!");
	//		Возврат;
	//	КонецЕсли;
	//	
	//	Для Каждого Эл Из Файлы Цикл
	//		Если Не Эл.Загружен Тогда
	//			Попытка
	//				Файл = Новый Файл(Эл.Путь);
	//				Эл.УИД = Новый УникальныйИдентификатор();
	//				ДвДанные = Новый ДвоичныеДанные(Эл.Путь);
	//				ДвДанные.Записать(КаталогХранения + "\" + Строка(Эл.УИД) + Файл.Расширение);
	//				Эл.Загружен = Истина;
	//			Исключение
	//				Отказ = Истина;
	//				Сообщить(ОписаниеОшибки());
	//				Возврат;
	//			КонецПопытки;
	//		КонецЕсли;	
	//	КонецЦикла;					
	//Иначе	
	//	// 2. Если хранить файлы в базе в хранилище значений		
	//	МассивДанных = Новый Массив();
	//	Для Каждого Элемент Из Файлы Цикл
	//		Данные = Неопределено;
	//		Если Не Элемент.Загружен Тогда
	//			Попытка
	//				Элемент.УИД = Новый УникальныйИдентификатор();
	//				Данные = Новый ДвоичныеДанные(Элемент.Путь);
	//				Элемент.Загружен = Истина;
	//			Исключение
	//				Отказ = Истина;
	//				Сообщить("Файл """ + Элемент.Путь + """ не найден!");
	//				Возврат;
	//			КонецПопытки;
	//		КонецЕсли;	
	//		МассивДанных.Добавить(Данные);		
	//	КонецЦикла;
	//	ПоместитьВХранилище(МассивДанных);
	//КонецЕсли;	

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Файлы.Очистить();
	РегистраторКорреспонденции = Неопределено; //Справочники.ВходящаяКорреспонденция.ПустаяСсылка();
КонецПроцедуры
